{
  "andrewberardinelli": "If the Packers get to count NFL Championships, then I get to count my 2010 Walpole Fantasy Football League Championship! I'm Andrew Berardinelli, or Nelli (or a whole slew of other variants on that theme), and I've been around the league for a long time.  Once a strong contender in this league, I've fallen off in recent years, mostly due to thinking I'm smarter and better at fantasy than I really am. Maybe one day I'll follow in Daddy's footsteps and win a real WFFL championship... In the meantime I'll continue coming up with nitpicky winter meeting ideas and slogging through writing league power rankings.",
  "bryanrockwood": "Competitive. Relentless. Persistent. Warrior. All of these words can describe Bryan Rockwood, the proud owner of the Maise's Magic franchise. No one in the league leaves it all on the field quite like Rock. In fact there are far more adjectives that his league mates could use to further highlight just how much Bryan loved this league and fantasy football. However there is one word that none of his competitors would use - and that is “winner”. Despite all of the blood sweat and tears, this resolute owner still has yet to reach the promise land that is the championship weekend. There was a time that his spot in the league was in jeopardy thanks to the \"James Starks incident\". Since the pivot away from the Caucasian branding, Rock and the Maisie franchise are heading towards a long journey towards redemption. Battle in the Ball Fondlers is tough work, but the Maisie faithful will soon be rewarded.",
  "davidwians": "Webster's Dictionary defines David Wians as \"competent yet unremarkable.\" Sitting the top half of the league as judged by important metrics such as All Time Regular Season Points, Playoff Appearances, and Win Percentage, Wians is a consistent threat within the Walpole Fantasy Football League who has been unable to break into the elite tier of managers nor secure a Championship.  A proud member of the 30-50 Farell Hogs Division, he recognizes their collective failure in recent years to maintain the level of strength once associated with the division and vows help it outperform recent expectations. As the esteemed Philantropy Chair, Wians has failed to execute on all of the many \"awesome league events\" that he has come up with over the years. When pressed on this issue Wians responded \"this is exactly what you voted for.\"Losing the 2023 Pooper Bowl is certainly an all-time low for the once respected franchise. And yet, in possession of several additional 2023 draft picks and vowing to get \"even more blackout drunk at the draft\" one can clearly chart the upward trajectory of this franchise.",
  "durgan": "Ask me about living a day as a clown.",
  "feastconley": "Having two championships is pretty nice and all, but we all know what I really do in this league: declare that i know picks as they happen during the draft, and annoyingly claim to know a 5th string wide receiver whenever I can. Much love to my boys Kalif, Maurice Jones Drew, and Philip Lindsay!",
  "jacksonpaslaski": "As one of the league's original owners, Jackson has a championship under his belt, a 52% win rate, and the record for most points scored in a single game. Outside of the league, Jackson has spent years working in cybersecurity in both the public and private sectors in the Washington, D.C. metro area. However, he and his long-time partner and fiancée, Brooke, have recently relocated to Providence, Rhode Island.Fun Fact: Jackson once ate over 2.5 lbs of tater tots in under ten minutes to win a tater-tot-eating competition that resulted in free tater tots for a year.",
  "joe": "Before Daddy's House was a team, Daddy's House house was fantasy football. The faithful have honored these seeds for generations to witness the evolution of greatness. An East Walpole boy who blew open the door to the WFFL. We took the 12th drafting slot and hung over a hundred on ‘em. Melvin Gordon and Keenan Allen shattered the way we see keepers. While others catch up, we lead it. Because winning, well we know daddy invented that. A band of brothers flying daddy's colors for over 10 years. There's always been and still is…only one Daddy's House.",
  "joseyumet": "Ask me why I haven't submitted my bio",
  "justinconnolly": "Fans, I see you have made it to my blurb. Welcome to the owner's suite belonging to the WFFL's newest and freshest member, Justin P. Connolly (J-BÈBÉ). Mr. BÈBÉ acquired ownership of this franchise in 2021. On day one, he pledged to bring a championship to his newly acquired franchise; that seemed to be a tall order considering the team's prior success rate. After extensive wheeling, dealing, breaking necks, and cashing checks, he turned a dumpster fire into a field of evergreen, with great potential for growth and prosperity. How long will it take for J-BÈBÉ's vision to come into focus? Who's to say? Would he make a deal with the devil to make it happen? You bet your ass he would. So sit back, relax, and grab yourself a negroni - cuz it's gonna be a wild ride.",
  "kevinconley": "Despite never having won a championship, I try to hang my hat on my superlatives for \"most likely to autodraft\" and \"most likely to attend a league meeting remotely\". The late 20-teens was a tough stretch for me and the Koins organization, but we've turned it around thanks to an exciting pipeline of keepers. A proud contender in the most competitive division in the league, I aspire to hoist the trophy on its behalf one day",
  "mattbloom": "If one thing has been consistent in this league since inception, it's me. Matt Bloom. aka The Commish. The title of Commissioner is an honor and a burden I'm happy to bear, no matter how bad they mocked me for 2014 4th round draft pick Bishop Sankey. While the league has seen immense transformation over the years, my ability to close out the championship matchup has not…(am I the 90s Bills?). Anyway, I'm humbled by the passion and dedication our current owners show every season. From a legitimate rulebook, to the melon smashing ritual, to this very website being built; all I can say is DO BETTER. Got a problem with that? You can \"save it for the winter meetings\".",
  "zachbannon": "Zach bannon is the divine ruler of the Imperium of Ban. As the God Emperor of the know universe it was only a matter of time before he encountered an abstract xeno race that he was not the supreme leader of..Yet. The Emperor has taken a sabbatical from his royal duties to completely immerse himself in this new species most exhilarating form of competition, Fantasy Football. His excellency joined the most established, competitive, and reputable league on the planet known in the common tongue as the WFFL. Despite his omnipotence he experiences in his own kingdom, this prescience does not penetrate the realm of the WFFL due to a strict rules against “cheating”. The humanized God Emperor looks to expand his kingdom and conquer the WFFL but it has not been an easy campaign. Failure is a great teacher and his majesty has learned many lessons on his journey to supremacy. While he still has much to learn, he is confident that he will lord over the WFFL as he lords over all else."
}